In [3]:
people = {
    "first": ["Robert", "John", "Jane"],
    "last": ["Stark", "Doe", "Doe"],
    "email": ["robstark@gmail.com", "johndoe@gmail.com", "janedoe@gmail.com"],
}


import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

    first   last               email
0  Robert  Stark  robstark@gmail.com
1    John    Doe   johndoe@gmail.com
2    Jane    Doe   janedoe@gmail.com

In [6]:
df['first'] + ' ' + df['last']

0    Robert Stark
1        John Doe
2        Jane Doe
dtype: object

In [7]:
df['full_name'] = df['first'] + ' ' + df['last']

In [8]:
df

    first   last               email     full_name
0  Robert  Stark  robstark@gmail.com  Robert Stark
1    John    Doe   johndoe@gmail.com      John Doe
2    Jane    Doe   janedoe@gmail.com      Jane Doe

In [11]:
df.drop(columns=["first", "last"], inplace=True )

In [12]:
df

                email     full_name
0  robstark@gmail.com  Robert Stark
1   johndoe@gmail.com      John Doe
2   janedoe@gmail.com      Jane Doe

In [14]:
df['full_name'].str.split(" ", expand=True)

        0      1
0  Robert  Stark
1    John    Doe
2    Jane    Doe

In [17]:
df[['first', 'last']] = df['full_name'].str.split(" ", expand=True)

In [18]:
df

                email     full_name   first   last
0  robstark@gmail.com  Robert Stark  Robert  Stark
1   johndoe@gmail.com      John Doe    John    Doe
2   janedoe@gmail.com      Jane Doe    Jane    Doe